[
  {
    "text":"Al-Mustawrid reported: The Messenger of ALLAH (ﷺ), peace and blessings be upon him, said: What is the example of this worldy life in comparison to the Hereafter other than one of you dipping his finger in the sea? Let him see what he brings forth.",
    "source":"Hadith",
    "reference":"Sahih Muslim"
  },
  {
    "text":"Abu Sa`id Al-Khudri(may ALLAH be pleased with him) said that the Prophet (ﷺ) said: The lowest of the people in status in Paradise will be a man whose face ALLAH turns away from the Fire towards Paradise, and shows him a tree giving shade. He will say,'O Lord, bring me closer to that tree so that I may be in its shade...Then he will enter his house(in Paradise)and his two wives from among Al-Hur Al-`Iyn will come in and will say to him, `Praise be to ALLAH who brought you to life for us and brought us to life for you.' Then he will say, `No one has been given what I have been given.",
    "source":"Hadith" ,
    "reference":"Sahih Muslim"
  },
  {
    "text":"Narrated by Abu Musa: While we were with ALLAH's Messenger (ﷺ) in a holy battle, we never went up a hill or reached its peak or went down a valley but raised our voices with Takbir. Allah's Messenger came close to us and said, O people! Don't exert yourselves, for you do not call a deaf or an absent one, but you call the All-Listener, the All-Seer. The Prophet then said, O 'Abdullah bin Qais! Shall I teach you a sentence which is from the treasures of Paradise? ( It is): 'Lahaula wala quwata illa billah. (There is neither might nor power except with Allah)." ,
    "source":"Hadith" ,
    "reference":"Sahih al-Bukhari"
  },
  {
    "text":"It was narrated from Abu Hurairah that the Messenger of ALLAH (ﷺ) said: Islam began as something strange and will go back to being strange, so glad tidings to the strangers." ,
    "source":"Hadith" ,
    "reference":"Sunan Ibn Majah (Grade: Sahih (Darussalam))"
  },
  {
    "text":"Do they not then reflect on the Quran? Or are there locks upon their hearts?" ,
    "source":"Quran" ,
    "reference":"47:24"
  },
  {
    "text":"'Abdullah ibn Mas'ud (may ALLAH be pleased with him) reported that the Prophet (ﷺ) said: O Allah, just as You made my external form beautiful, make my character beautiful as well." ,
    "source":"Hadith" ,
    "reference":"Ahmad"
  },
  {
    "text":"It was narrated from 'Aishah that the Messenger of ALLAH (ﷺ) said: Whoever loves to meet ALLAH, ALLAH loves to meet him, and whoever hates to meet ALLAH, ALLAH hates to meet him. It was said to him: O Messenger of ALLAH, does hating to meet ALLAH mean hating to meet death? For all of us hate death. He said: 'No. Rather that is only at the moment of death. But if he is given the glad tidings of the mercy and forgiveness of ALLAH, he loves to meet ALLAH and ALLAH loves to meet him; and if he is given the tidings of the punishment of ALLAH, he hates to meet ALLAH and ALLAH hates to meet him." ,
    "source":"Hadith" ,
    "reference":"Sunan Ibn Majah (Grade: Sahih (Darussalam)"
  },
  {
    "text":"Abu Sa'id Al-Khudri (May ALLAH be pleased with him) reported: Messenger of ALLAH (ﷺ) said, 'How can I feel at ease when the Angel of the Trumpet, (Israfil) has put his lips to the Trumpet and is waiting for the order to blow it.' He perceived as if this had shocked his Companions, so he told them to seek comfort through reciting: 'Hasbunallah wa ni'mal-Wakil 'ALLAH (Alone) is Sufficient for us, and He is the Best Disposer of affairs (for us)'." ,
    "source":"Hadith" ,
    "reference":"At-Tirmidhi, who classified it as Hasan(Good)"
  },
  {
    "text":"This (the Quran) is a plain statement for mankind, a guidance and instruction to those who are Al-Muttaqun(the pious)" ,
    "source":"Quran" ,
    "reference":"3:138"
  },
  {
    "text":"And so are the days (good and not so good), We give to men by turns, that ALLAH may test those who believe" ,
    "source":"Quran" ,
    "reference":"3:140"
  },
  {
    "text":"And whoever is mindful of ALLAH, He will make a way out for them, and provide for them from sources they could never imagine. And whoever puts their trust in ALLAH, then He (alone) is sufficient for them. Certainly ALLAH achieves His Will. ALLAH has already set a destiny for everything" ,
    "source":"Quran" ,
    "reference":"65:2-3"
  },
  {
    "text":"And marry off the unmarried among you and the righteous among your male slaves and female slaves. If they should be poor, Allāh will enrich them from His bounty, and Allāh is all-Encompassing and Knowing." ,
    "source":"Quran" ,
    "reference":"24:32"
  },
  {
    "text":"On the authority of Abu Hurayrah (may ALLAH be pleased with him) who said: The Messenger of ALLAH (ﷺ) said, “Part of the perfection of one’s Islam is his leaving that which does not concern him." ,
    "source":"Hadith" ,
    "reference":"At-Tirmidhi, who classified it as Hasan(Good)."
  },
  {
    "text":"Narrated by Abu Huraira: A man said to the Prophet (ﷺ) , Advise me! The Prophet (ﷺ) said, Do not become angry. The man asked (the same) again and again, and the Prophet (ﷺ) said in each case, Do not become angry." ,
    "source":"Hadith" ,
    "reference":"Sahih al-Bukhari"
  },
  {
    "text":"The Prophet (ﷺ) said, Whoever believes in ALLAH and the Last Day, should not hurt his neighbor and whoever believes in ALLAH and the Last Day, should serve his guest generously and whoever believes in ALLAH and the Last Day, should speak what is good or keep silent." ,
    "source":"Hadith" ,
    "reference":"Sahih al-Bukhari"
  },
  {
    "text":"On the of Abu Hamzah Anas bin Malik(may ALLAH be pleased with him)- the Messenger of ALLAH (ﷺ) said: None of you (truly) believes until he loves for his brother that which he loves for himself." ,
    "source":"Hadith" ,
    "reference":"Sahih al-Bukhari & Sahih Muslim"
  },
  {
    "text":"It was narrated from Sahl bin Mu’adh bin Anas, from his father, that the Messenger of ALLAH (ﷺ) said:Whoever restrains his anger when he is able to implement it, ALLAH will call him before all of creation on the Day of Resurrection, and will give him his choice of any houri that he wants." ,
    "source":"Hadith" ,
    "reference":"Sunan Ibn Majah (Grade:Hasan(Darussalam))"
  },
  {
    "text":"And what is wrong with you that you fight not in the Cause of ALLAH, and for those weak, ill-treated and oppressed among men, women, and children, whose cry is: \"Our Lord! Rescue us from this town whose people are oppressors; and raise for us from You one who will protect, and raise for us from You one who will help.\"" ,
    "source":"Quran" ,
    "reference":"4:75"
  },
  {
  "text":" Men are the protectors and maintainers of women, because ALLAH has made one of them to excel the other, and because they spend (to support them) from their means. Therefore the righteous women are devoutly obedient (to ALLAH and to their husbands), and guard in the husband’s absence what ALLAH orders them to guard (e.g. their chastity, their husband’s property). As to those women on whose part you see ill-conduct, admonish them (first), (next), refuse to share their beds, (and last) beat them (lightly, if it is useful); but if they return to obedience, seek not against them means (of annoyance). Surely, ALLAH is Ever Most High, Most Great." ,
  "source":"Quran" ,
  "reference":"4:34"
  },
  {
    "text":"And this life of the world is only an amusement and a play! Verily, the home of the Hereafter - that is the life indeed (i.e. the eternal life that will never end), if they but knew." ,
    "source":"Quran" ,
    "reference":"29:64"
  },
  {
    "text":"Say, “Are you awaiting anything to befall us except one of the two best things: ˹victory or martyrdom˺? But We are awaiting ALLAH to afflict you with torment either from Him or at our hands. So keep waiting! We too are waiting with you.”" ,
    "source":"Quran" ,
    "reference":"9:52"
  },
  {
    "text":"Fighting has been made obligatory upon you ˹believers˺, though you dislike it. Perhaps you dislike something which is good for you and like something which is bad for you. ALLAH knows and you do not know." ,
    "source":"Quran" ,
    "reference":"2:216"
  },
  {
    "text":"Do you think you will be admitted into Paradise without being tested like those before you? They were afflicted with suffering and adversity and were so ˹violently˺ shaken that ˹even˺ the Messenger and the believers with him cried out, “When will ALLAH’s help come?” Indeed, ALLAH’s help is ˹always˺ near." ,
    "source":"Quran" ,
    "reference":"2:214"
  },
  {
    "text":"Is not He Who created the heavens and the earth, Able to create the like of them? Yes, indeed! He is the All-Knowing Supreme Creator. Verily, His Command, when He intends a thing, is only that He says to it, \"Be!\" - and it is! So glorified be He and exalted above all that they associate with Him, and in Whose Hands is the dominion of all things: and to Him you shall be returned." ,
    "source":"Quran" ,
    "reference":"36:81-83"
  },
  {
    "text":"Remember Me; I will remember you. And thank Me, and never be ungrateful." ,
    "source":"Quran" ,
    "reference":"2:152"
  },
  {
    "text":"The Prophet (ﷺ) said, \"ALLAH says: 'I am just as My slave thinks I am, (i.e. I am able to do for him what he thinks I can do for him) and I am with him if He remembers Me. If he remembers Me in himself, I too, remember him in Myself; and if he remembers Me in a group of people, I remember him in a group that is better than they; and if he comes one span nearer to Me, I go one cubit nearer to him; and if he comes one cubit nearer to Me, I go a distance of two outstretched arms nearer to him; and if he comes to Me walking, I go to him running.' \"" ,
    "source":"Hadith" ,
    "reference":"Sahih al-Bukhari"
  },
  {
    "text":"And We have enjoined on man to be dutiful and kind to his parents." ,
    "source":"Quran" ,
    "reference":"46:15"
  },
  {
    "text":"And ˹remember˺ when your Lord proclaimed, ‘If you are grateful, I will certainly give you more. But if you are ungrateful, surely My punishment is severe.’" ,
    "source":"Quran" ,
    "reference":"14:7"
  },
  {
    "text":"Your Lord has proclaimed, “Call upon Me, I will respond to you. Surely those who are too proud to worship Me will enter Hell, fully humbled.”" ,
    "source":"Quran" ,
    "reference":"40:60"
  },
  {
    "text":"Verily, along with every hardship is relief " ,
    "source":"Quran" ,
    "reference":"94:6"
  },
  {
    "text":"On the authority of Abu Ya’la Shaddad bin Aws (may Allah be pleased with him), that the Messenger of ALLAH (ﷺ) said: Verily Allah has prescribed ihsan (proficiency, perfection) in all things. So if you kill then kill well; and if you slaughter, then slaughter well. Let each one of you sharpen his blade and let him spare suffering to the animal he slaughters." ,
    "source":"Hadith" ,
    "reference":"Sahih Muslim"
  },
  {
    "text":"But seek, through that which ALLAH has given you, the home of the Hereafter; and [yet], do not forget your share of the world. And do good as ALLAH has done good to you. And desire not corruption in the land. Indeed, ALLAH does not like corrupters." ,
    "source":"Quran" ,
    "reference":"28:77"
  },
  {
    "text":"It was narrated from Abu Hurairah that the Messenger of ALLAH (ﷺ) said: \"There are three who are promised the help of ALLAH: The Mukatab(slave who had made a contract of manumission) who wants to buy his freedom, the one who gets married seeking to keep himself chaste, and the Mujahid who fights in the cause of ALLAH.\"" ,
    "source":"Hadith" ,
    "reference":"Sunan an-Nasa'i (Grade: Hasan(Darussalam)"
  },
  {
    "text":"On the authority of Abu Hurayrah (ra): I heard the Messenger of ALLAH (ﷺ) say, “What I have forbidden for you, avoid. What I have ordered you [to do], do as much of it as you can. For verily, it was only the excessive questioning and their disagreeing with their Prophets that destroyed [the nations] who were before you.”" ,
    "source":"Hadith" ,
    "reference":"Sahih al-Bukhari & Sahih Muslim"
  },
  {
    "text":"And when My slaves ask you (O Muhammad صلى الله عليه وسلم) concerning Me, then (answer them), I am indeed near (to them by My Knowledge). I respond to the invocations of the supplicant when he calls on Me (without any mediator or intercessor). So let them obey Me and believe in Me, so that they may be led aright." ,
    "source":"Quran" ,
    "reference":"2:186"
  },
  {
    "text":"Abu Hurayra reported that the Messenger of ALLAH, may ALLAH bless him and grant him peace, said, \"What is the most frequent reason for someone entering Paradise?\" He said, \"Taqwa and good character. He was asked, \"What is the most frequent reason for people entering the Hellfire?\" He replied, \"The two empty ones: the mouth and the genitals.\"" ,
    "source":"Hadith" ,
    "reference":"Graded: Hasan(Al-Albani)"
  },
  {
    "text":"Abu Umama said he heard ALLAH's Messenger (ﷺ) say: Recite the Qur'an, for on the Day of Resurrection it will come as an intercessor for those who recite It." ,
    "source":"Hadith" ,
    "reference":"Sahih Muslim"
  },
  {
    "text":"On the authority of Abu Malik al-Harith bin Asim al-Asharee (may ALLAH be pleased with him) who said: The Messenger of ALLAH (peace and blessings of ALLAH be upon him) said, “Purity is half of iman (faith). ‘Al-hamdu lillah (praise be to ALLAH)’ fills the scales, and ‘subhan-ALLAH (how far is ALLAH from every imperfection) and ‘Al-hamdulillah (praise be to ALLAH)’ fill that which is between heaven and earth. And the salah (prayer) is a light, and charity is a proof, and patience is illumination, and the Qur’an is a proof either for you or against you. Every person starts his day as a vendor of his soul, either freeing it or causing its ruin.”" ,
    "source":"Hadith" ,
    "reference":"Sahih Muslim"
  },
  {
    "text":"And do not approach unlawful sexual intercourse. Indeed, it is ever an immorality and is evil as a way." ,
    "source":"Quran" ,
    "reference":"17:32"
  },
  {
    "text":"When the two groups came face to face, the companions of Moses cried out, “We are overtaken for sure.” Moses reassured ˹them˺, “Absolutely not! My Lord is certainly with me—He will guide me.” So We inspired Moses: “Strike the sea with your staff,” and the sea was split, each part was like a huge mountain." ,
    "source":"Quran" ,
    "reference":"26:61-63"
  },
  {
    "text":"Tell the believing men to lower their gaze (from looking at forbidden things), and protect their private parts (from illegal sexual acts). That is purer for them. Verily, ALLAH is All-Aware of what they do." ,
    "source":"Quran" ,
    "reference":"24:30"
  },
  {
    "text":"Abu Huraira reported: The Messenger of Allah (ﷺ) came to the graveyard and said: \"Peace be upon you! The abode of the believing people and we, if God so wills, are about to join you. I love to see my brothers.\" They (the hearers) said: Aren't we your brothers, O Messenger of ALLAH? He said: You are my companions, and our brothers are those who have, so far, not come into the world. They said: Messenger of ALLAH, how would you recognise those persons of your Ummah who have not yet been born? He said: Supposing a man had horses with white blazes on foreheads and legs among horses which were all black, tell me, would he not recognise his own horses? They said: Certainly, O Messenger of ALLAH. He said: They would come with white faces and arms and legs owing to ablution, and I would arrive at the Cistern before them. Some people would be driven away from my Cistern as the stray camel is driven away. I would call out: Come, come. Then it would be said (to me): These people changed themselves after you, and I would say: Be off, be off." ,
    "source":"Hadith" ,
    "reference":"Sahih Muslim"
  },
  {
    "text":"Anas bin Malik narrated that the Messenger of Allah (ﷺ) said: \"There shall come upon the people a time in which the one who is patient upon his religion will be like the one holding onto a burning ember.\"" ,
    "source":"Hadith" ,
    "reference":"At-Tirmidhi (Grade: Sahih(Al-Albani))"
  },
  {
    "text":" ALLAH burdens not a person beyond his scope. He gets reward for that (good) which he has earned, and he is punished for that (evil) which he has earned. \"Our Lord! Punish us not if we forget or fall into error, our Lord! Lay not on us a burden like that which You did lay on those before us (Jews and Christians); our Lord! Put not on us a burden greater than we have strength to bear. Pardon us and grant us Forgiveness. Have mercy on us. You are our Maulâ (Patron, Supporter and Protector, etc.) and give us victory over the disbelieving people." ,
    "source":"Quran" ,
    "reference":"2:286"
  },
  {
    "text":"Every soul will taste death. And We test you with evil and with good as trial; and to Us you will be returned." ,
    "source":"Quran" ,
    "reference":"21:35"
  },
  {
    "text":"As for he who gives and fears ALLAH. And believes in the best [reward]. We will facilitate for them the Way of Ease." ,
    "source":"Quran" ,
    "reference":"92:5-7"
  },
  {
    "text":"The believers are only those who, when ALLAH is mentioned, feel a fear in their hearts and when His Verses (this Qur’ân) are recited unto them, they (i.e. the Verses) increase their Faith; and they put their trust in their Lord (Alone)." ,
    "source":"Quran" ,
    "reference":"8:2"
  },
  {
    "text":"Those who remember ALLAH (always, and in prayers) standing, sitting, and lying down on their sides, and think deeply about the creation of the heavens and the earth, (saying): \"Our Lord! You have not created (all) this without purpose, glory to You! (Exalted are You above all that they associate with You as partners). Give us salvation from the torment of the Fire." ,
    "source":"Quran" ,
    "reference":"3:191"
  },
  {
    "text":"Narrated Abu Huraira: One day while the Prophet (ﷺ) was sitting in the company of some people, (The angel) Gabriel came and asked, \"What is faith?\" ALLAH's Messenger (ﷺ) replied, 'Faith is to believe in ALLAH, His angels, (the) meeting with Him, His Apostles, and to believe in Resurrection.\" Then he further asked, \"What is Islam?\" ALLAH's Messenger (ﷺ) replied, \"To worship ALLAH Alone and none else, to offer prayers perfectly to pay the compulsory charity (Zakat) and to observe fasts during the month of Ramadan.\" Then he further asked, \"What is Ihsan (perfection)?\" ALLAH's Messenger (ﷺ) replied, \"To worship ALLAH as if you see Him, and if you cannot achieve this state of devotion then you must consider that He is looking at you.\" Then he further asked, \"When will the Hour be established?\" ALLAH's Messenger (ﷺ) replied, \"The answerer has no better knowledge than the questioner. But I will inform you about its portents. 1. When a slave (lady) gives birth to her master. 2. When the shepherds of black camels start boasting and competing with others in the construction of higher buildings. And the Hour is one of five things which nobody knows except ALLAH. The Prophet (ﷺ) then recited: \"Verily, with ALLAH (Alone) is the knowledge of the Hour--.\" (31. 34) Then that man (Gabriel) left and the Prophet (ﷺ) asked his companions to call him back, but they could not see him. Then the Prophet (ﷺ) said, \"That was Gabriel who came to teach the people their religion.\" Abu 'Abdullah said: He (the Prophet) considered all that as a part of faith." ,
    "source":"Hadith" ,
    "reference":"Sahih al-Bukhari"
  },
  {
    "text":" And I (ALLAH) created not the jinn and mankind except that they should worship Me (Alone)." ,
    "source":"Quran" ,
    "reference":"51:56"
  },
  {
    "text":"Anas (May ALLAH be pleased with him) reported:\nThe Messenger of ALLAH (ﷺ) and his Companions reached Badr before the polytheists, and when they arrived, he (ﷺ) directed: \"Let no one of you advance ahead of me.\" When the polytheists came near, the Messenger of ALLAH (ﷺ) said, \"Now stand up and proceed towards Jannah which is as wide as are the heavens and the earth.\" 'Umair bin Al-Humam (May ALLAH be pleased with him) asked: \"Is Jannah as wide as are the heaven and the earth?\" The Messenger of ALLAH (ﷺ) replied in the affirmative. 'Umair remarked: \"Great!\" The Messenger of ALLAH (ﷺ) asked him what had urged him to say so. He replied: \"Nothing, O Messenger of ALLAH! But hope that I might become one of the inhabitants of Jannah.\" The Messenger of ALLAH (ﷺ) said, \"You will definitely be among them.\" 'Umair then took some dates out of his quiver and began to eat them, but after a short time he said: \"If I survive till I eat my dates, it will mean a long life.\" So he threw away the dates which he had with him and then fought with the enemy till he was killed." ,
    "source":"Hadith" ,
    "reference":"Sahih Muslim"
  },
  {
    "text":"On the authority of Abu Hurayrah (may ALLAH be pleased with him), who said that the Messenger of ALLAH (ﷺ) said: ALLAH (mighty and sublime be He) said: Whosoever shows enmity to someone devoted to Me, I shall be at war with him. My servant draws not near to Me with anything more loved by Me than the religious duties I have enjoined upon him, and My servant continues to draw near to Me with supererogatory works so that I shall love him. When I love him I am his hearing with which he hears, his seeing with which he sees, his hand with which he strikes and his foot with which he walks. Were he to ask [something] of Me, I would surely give it to him, and were he to ask Me for refuge, I would surely grant him it. I do not hesitate about anything as much as I hesitate about [seizing] the soul of My faithful servant: he hates death and I hate hurting him." ,
    "source":"Hadith" ,
    "reference":"Sahih al-Bukhari"
  },
  {
    "text":"Abu Hurairah said: I heard the Messenger of Allah (ﷺ) saying: ‘This world is cursed and what is in it is cursed, except the remembrance of Allah (dhikr) and what is conducive to that, or one who has knowledge or who acquires knowledge." ,
    "source":"Hadith" ,
    "reference":"Sunan Ibn Majah (Grade:Hasan(Darussalam))"
  },
  {
    "text":"Strive for ˹the cause of˺ ALLAH in the way He deserves, for ˹it is˺ He ˹Who˺ has chosen you, and laid upon you no hardship in the religion—the way of your forefather Abraham. ˹It is ALLAH˺ Who named you ‘the ones who submit’ ˹in the˺ earlier ˹Scriptures˺ and in this ˹Quran˺, so that the Messenger may be a witness over you, and that you may be witnesses over humanity. So establish prayer, pay alms-tax, and hold fast to ALLAH. He ˹alone˺ is your Guardian. What an excellent Guardian, and what an excellent Helper!" ,
    "source":"Quran" ,
    "reference":"22:78"
  },
  {
    "text":"Those who believed (in the Oneness of ALLAH - Islâmic Monotheism), and whose hearts find rest in the remembrance of ALLAH: verily, in the remembrance of ALLAH do hearts find rest" ,
    "source":"Quran" ,
    "reference":"13:28"
  },
  {
    "text":"ALLAH gives abundant or limited provisions to whoever He wills. And the disbelievers become prideful of ˹the pleasures of˺ this worldly life. But the life of this world, compared to the Hereafter, is nothing but a fleeting enjoyment." ,
    "source":"Quran" ,
    "reference":"13:26"
  },
  {
    "text":"I heard Abu Al-Ahwas saying to us in a gathering with Ibn Al-Musayyab when Ibn Al-Musayyab was sitting there, that he had heard Abu Dharr say: The Messenger of ALLAH (ﷺ) said: ALLAH (SWT) continues to look upon His slave while he is praying, so long as he does not turn away. If he turns his face away, He turns away from him." ,
    "source":"Hadith" ,
    "reference":"Sunan an-Nasa'i (Grade: Hasan(Darussalam)"
  },
  {
    "text":"And my guidance cannot come except from ALLAH, in him I trust and unto him I repent" ,
    "source":"Quran" ,
    "reference":"11:88"
  },
  {
    "text":"Narrated Mu`adh bin Jabal: The Prophet (ﷺ) said, \"O Mu`adh! Do you know what ALLAH's Right upon His slaves is?\" I said, \"ALLAH and His Apostle know best.\" The Prophet (ﷺ) said, \"To worship Him (ALLAH) Alone and to join none in worship with Him (ALLAH). Do you know what their right upon Him is?\" I replied, \"ALLAH and His Apostle know best.\" The Prophet (ﷺ) said, \"Not to punish them (if they do so)." ,
    "source":"Hadith" ,
    "reference":"Sahih al-Bukhari"
  },
  {
    "text":"Verily, those who say: \"Our Lord is ALLAH (Alone),\" and then they stand firm, on them the angels will descend (at the time of their death) (saying): \"Fear not, nor grieve! But receive the glad tidings of Paradise which you have been promised!\"We have been your friends in the life of this world and are (so) in the Hereafter. Therein you shall have (all) that your inner-selves desire, and therein you shall have (all) for which you ask. An entertainment from (ALLAH), the Oft-Forgiving, Most Merciful."  ,
    "source":"Quran" ,
    "reference":"41:30-32"
  },
  {
    "text":"And if you are tempted by Satan, then seek refuge with ALLAH. Indeed, He ˹alone˺ is the All-Hearing, All-Knowing." ,
    "source":"Quran" ,
    "reference":"41:36"
  },
  {
    "text":"Abu Darda reported that the Messenger of ALLAH (ﷺ) said: No Muslim servant supplicates for his brother behind his back (in his absence) but that the angel says: 'And for you the same'" ,
    "source":"Hadith" ,
    "reference":"Sahih Muslim"
  },
  {
    "text":" For him (each person), there are angels in succession, before and behind him. They guard him by the Command of ALLAH. Verily! ALLAH will not change the (good) condition of a people as long as they do not change their state (of goodness) themselves (by committing sins and by being ungrateful and disobedient to ALLAH). But when ALLAH wills a people’s punishment, there can be no turning back of it, and they will find besides Him no protector." ,
    "source":"Quran" ,
    "reference":"13:11"
  },
  {
    "text":"ALLAH's Messenger (ﷺ) said: ALLAH loves a slave who is pious, self-sufficient and unnoticed." ,
    "source":"Hadith" ,
    "reference":"Sahih Muslim"
  },
  {
    "text":"Then High above all be ALLAH, the True King. And be not in haste (O Muhammad صلى الله عليه وسلم) with the Qur’ân before its revelation is completed to you, and say: My Lord! Increase me in knowledge." ,
    "source":"Quran" ,
    "reference":"20:114"
  },
  {
    "text":"Verily, the Hour is coming - and I am almost hiding it from Myself - that every person may be rewarded for that which he strives." ,
    "source":"Quran" ,
    "reference":"20:15"
  },
  {
    "text":"Abu Hurairah (May ALLAH be pleased with him) reported: The Prophet (ﷺ) said, When ALLAH loves a slave, calls out Jibril and says: 'I love so-and-so; so love him'. Then Jibril loves him. After that he (Jibril) announces to the inhabitants of heavens that ALLAH loves so- and-so; so love him; and the inhabitants of the heavens (the angels) also love him and then make people on earth love him." ,
    "source":"Hadith" ,
    "reference":"Sahih Bukhari & Sahih Muslim"
  },
  {
    "text":"And indeed, Our soldiers(the believers) will be those who overcome" ,
    "source":"Quran" ,
    "reference":"37:173"
  },
  {
    "text":"Were they created by nothing? Or were they themselves the creators? Or did they create the heavens and the earth? Nay, but they have no firm belief." ,
    "source":"Quran" ,
    "reference":"52:35-36"
  },
  {
    "text":"No calamity ˹or blessing˺ occurs on earth or in yourselves without being ˹written˺ in a Record before We bring it into being. This is certainly easy for ALLAH.˹We let you know this˺ so that you neither grieve over what you have missed nor boast over what He has granted you. For ALLAH does not like whoever is arrogant, boastful" ,
    "source":"Quran" ,
    "reference":"57:22-23"
  },
  {
    "text":"˹Remember˺ when those youths took refuge in the cave, and said, “Our Lord! Grant us mercy from Yourself and guide us rightly through our ordeal.”" ,
    "source":"Quran" ,
    "reference":"18:10"
  },
  {
    "text":"When death approaches any of them, they cry, “My Lord! Let me go back,so I may do good in what I left behind.” Never! It is only a ˹useless˺ appeal they make. And there is a barrier behind them until the Day they are resurrected." ,
    "source":"Quran" ,
    "reference":"23:99-100"
  },
  {
    "text":"And indeed We have created man, and We know what his ownself whispers to him. And We are nearer to him that his jugular vein(by Our Knowledge)" ,
    "source":"Quran" ,
    "reference":"50:16"
  },
  {
    "text":"Every soul will taste death, and you will only be given you (full) compensation on the Day of Resurrection. So he who is drawn away from the Fire and admitted to Paradise has attained(his desire). And what is the life of this world except the enjoyment of delusion." ,
    "source":"Quran" ,
    "reference":"3:185"
  },
  {
    "text":"He (satan) makes promises to them, and arouses in them false desires, and satan's promises are nothing but deceptions." ,
    "source":"Quran" ,
    "reference":"4:120"
  },
  {
    "text":"Indeed, ALLAH only accepts from the righteous(who fear him)" ,
    "source":"Quran" ,
    "reference":"5:27"
  },
  {
    "text":"Narrated by Ibn `Abbas: The Prophet (ﷺ) said: There are two blessings that many people are deceived into losing: health and free time." ,
    "source":"Hadith" ,
    "reference":"Bukhari"
  },
  {
    "text":"It was narrated that Ibn ‘Umar said: “I was with the Messenger of ALLAH (ﷺ) and a man from among the Ansar came to him and greeted the Prophet (ﷺ) with Salam. Then he said: ‘O Messenger of ALLAH, which of the believers is best?’ He said: ‘He who has the best manners among them.’ He said: ‘Which of them is wisest?’ He said: ‘The one who remembers death the most and is best in preparing for it. Those are the wisest.’”" ,
    "source":"Hadith" ,
    "reference":"Sunan Ibn Majah (Grade:Hasan(Darussalam))"
  },
  {
    "text":"Mujahid narrated that Ibn 'Umar said:\"The Messenger of ALLAH (s.a.w) grabbed me on part of my body and said: 'Be in the world like a stranger or a passerby, and count yourself among the inhabitants of the grave.'\" Ibn 'Umar said to me: \"When you wake up in the morning, then do not concern yourself with the evening. And when you reach the evening, then do not concern yourself with the morning. Take from your health before your illness, and from your life before your death, for indeed O slave of ALLAH! You do not know what your description shall be tomorrow.\"" ,
    "source":"Hadith" ,
    "reference":"At-Tirmidhi (Grade: Sahih)"
  },
  {
    "text":"[Allāh said], \"And what made you hasten from your people, O Moses?\" He said: \"They are close on my footsteps: and I hastened to You, O my Lord, that You might be pleased.\"" ,
    "source":"Quran" ,
    "reference":"20:83-84"
  },
  {
    "text":"So be patient! Surely the ultimate outcome belongs ˹only˺ to the righteous." ,
    "source":"Quran" ,
    "reference":"11:49"
  },
  {
    "text":"Abu Hurairah (RAA) narrated that the Messenger of ALLAH (ﷺ) said:\n“A believer who is strong (and healthy) is better and dearer to ALLAH than the weak believer, but there is goodness in both of them. Be keen on what benefits you and seek help from ALLAH, and do not give up. If anything afflicts you do not say, ‘If I had done such and such things, such and such would have happened.’ But say, ‘ALLAH decrees and what He wills He does,’ for (the utterance) ‘If I had’ provides an opening for the deeds of the devil.”" ,
    "source":"Hadith" ,
    "reference":"Sahih Muslim"
  },
  {
    "text":"A bedouin came to the Prophet (ﷺ) and said, \"O ALLAH's Messenger (ﷺ)! Who is the best of mankind!\" The Prophet said, \"A man who strives for ALLAH's Cause with his life and property, and also a man who lives (all alone) in a mountain path among the mountain paths to worship his Lord and save the people from his evil.\"" ,
    "source":"Hadith" ,
    "reference":"Sahih al-Bukhari"
  },
  {
    "text":"[Iblîs (Satan)] said: \"By Your Might, then I will surely mislead them all,\"Except Your chosen slaves amongst them (i.e. faithful, obedient, true believers of Islâmic Monotheism).\"" ,
    "source":"Quran" ,
    "reference":"38:82-83"
  },
  {
    "text":"So when you want to recite the Qur’ân, seek refuge with ALLAH from Shaitân (Satan), the outcast (the cursed one).Verily! He has no power over those who believe and put their trust only in their Lord (ALLAH)." ,
    "source":"Quran" ,
    "reference":"16:98-99"
  },
  {
    "text":"Then when you have taken a decision, put your trust in ALLAH, certainly, ALLAH loves those who put their trust(in Him)." ,
    "source":"Quran" ,
    "reference":"3:159"
  },
  {
    "text":"And many a Prophet (i.e. many from amongst the Prophets) fought (in ALLAH’s Cause) and along with him (fought) large bands of religious learned men. But they never lost heart for that which did befall them in ALLAH’s Way, nor did they weaken nor degrade themselves. And ALLAH loves As-Sâbirûn (the patient)." ,
    "source":"Quran" ,
    "reference":"3:146"
  },
  {
    "text":"Indeed, those who fear ALLAH - when an impulse touches them from satan, they remember(ALLAH) and at once they have insight." ,
    "source":"Quran" ,
    "reference":"7:201"
  },
  {
    "text":"Narrated by Abu Huraira: The Prophet (ﷺ) said: A believer is not stung twice (by something) out of one and the same hole." ,
    "source":"Hadith" ,
    "reference":"Sahih al-Bukhari"
  },
  {
    "text":"Narrated Abu Huraira: The Prophet (ﷺ) said, (There are) two words which are dear to the Beneficent (ALLAH) and very light (easy) for the tongue (to say), but very heavy in weight in the balance. They are: ''Subhan ALLAH wa-bi hamdihi'' and ''Subhan ALLAH Al-`Azim.." ,
    "source":"Hadith" ,
    "reference":"Sahih al-Bukhari"
  },
  {
    "text":"Shaddad bin Aus (May ALLAH be pleased with him) reported: The Prophet (ﷺ) said, \"A wise man is the one who calls himself to account (and refrains from doing evil deeds) and does noble deeds to benefit him after death; and the foolish person is the one who subdues himself to his temptations and desires and seeks from ALLAH the fulfillment of his vain desires\"." ,
    "source":"Hadith" ,
    "reference":"At-Tirmidhi (Grade: Hasan)"
  },
  {
    "text":"Do not falter or grieve, for you will have the upper hand, if you are (true) believers." ,
    "source":"Quran" ,
    "reference":"3:139"
  },
  {
    "text":"Narrated by 'Abdullah bin 'Amr: The Prophet (ﷺ) said, \"A Muslim is the one who avoids harming Muslims with his tongue and hands. And a Muhajir (emigrant) is the one who gives up (abandons) all what ALLAH has forbidden.\"" ,
    "source":"Hadith" ,
    "reference":"Sahih al-Bukhari"
  },
  {
    "text":"Talhah bin Khirash said:\n\"I head Jabir bin 'Abdullah say\" 'When 'Abdullah bin 'Amr bin )Haram) was killed on the Day of Uhud, the Messenger of ALLAH met me, and said: \"O Jabir, shall I not tell you what ALLAH has said to your father?\" Yahya said in his Hadith: \"And he said: 'O Jabir, why do I see you broken-hearted?' I (Jabir) said: 'O Messenger of ALLAH, my father has been martyred and he has left behind dependents and debts.' He said: 'Shall I not give you the glad tidings of that with which ALLAH met your father?' I said: 'Yes, O Messenger of ALLAH.' He said: 'ALLAH never spoke to anyone except from behind a screen, but He spoke to your father directly, and He said: \"O My slave! Ask something from Me and I shall give it to you.\" He said: \"O Lord, bring me back to life so that I may be killed in Your cause a second time.\" The Lord, Glorified is He, said: \"I have already decreed that they will not return to life.\" He said: \"My Lord, then convey (this news) to those whom I have left behind.\" ALLAH said: \"Think not of those as dead who are killed in the way of ALLAH, Nay, they are alive, with their Lord, and they have provision.\"" ,
    "source":"Hadith" ,
    "reference":"Sunan Ibn Majah (Grade: Hasan (Darussalam))"
  },
  {
    "text":"O mankind! Verily, the Promise of ALLAH is true. So let not his present life deceive you, and let not the chief deceiver(satan) deceive you about ALLAH." ,
    "source":"Quran" ,
    "reference":"35:5"
  }
]